<?php
echo
"<font color='green'><b>1. Надо добавить удаление пустынх строк<br> </font>
<font color='yellow'>2. Сделать проверки что бы пустные значения не добавлялись в таблицу<br></font>
3. Надо везде поменять Product на users, в том числе в Базе данных самой<br>
4. Доработать создание таблиц, что бы можно было вводить имя, и название полей, в идеале количество полей также. <br>
5. Сделать список так что бы можно было этот список редактировать, удалять, добавлять пункты, и отмечать выполненые<br>
<font color='green'>6. Поправить кнопик в верхнем фрейме<br></font>
7. Письма на странице пхп сделать формы, и сделать что бы обратная связь сохранялась в папку.<br>
8. Перенести эту борду на главную страницу<br>
9. Github <br>
<font color='green'>10. Добавление Юзера по шаблону имени и с выбором количества записей <br></font>
<font color='yellow'>11. По красоте надо сделать в кнопке Выборка селект который будет позволять выбрать Таблицу и получить по ней инфу<br></font>
<font color='green'>12. Сделать нормальную рандомную генерацию паролей<br></font>
<font color='green'>13. Доработка, теперь юзеры добавляются кол-во штук, с приростом айди. было 10, добавили 5, стало 15 с номерами от 10 до 15-го.<br></font>
<font color='green'>14. Сделать что бы таблица создавалась с авто инкрементом. <br></font>
<font color='red'>15. Проблемно передаются айдишники, в них нумерация сбита, берется не id а кол во строк, поэтому если есть 20 строк, с айди 40-60, то на эти записи не генеряится парои.  <br></font>
<font color='red'>16. Это все надо превратить в таск менеджер <br></font>
<br>
</b>"; 